# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. 


import random


lengh_1 = int(input('Введите число элементов первого массива: '))

list_1 = [random.randint(0,20) for _ in range(lengh_1)]


lengh_2 = int(input('Введите число элементов второго массива: '))

list_2 = [random.randint(0,20) for _ in range(lengh_2)]

print(list_1)
print(list_2)

set = set(list_1).intersection(set(list_2))

print(list(set))